In [2]:
import numpy as np
import pandas as pd

# MISSING DATA

In [3]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [4]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [15]:
import numpy as np
import pandas as pd

In [16]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [17]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
df.groupby('Company')
#this is just an object. When we printed it, it would point to where it's stored in memory

In [21]:
byComp = df.groupby('Company')
#we can now use aggregate functions
byComp.mean()
#It turned out no Person column is printed because it's String. No mean for String
# Pandas autometically ignores anything that's a non-numeric column

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [22]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [23]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [26]:
byComp.std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [28]:
#in one line of code
df.groupby('Company').std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [30]:
df .groupby('Company').count()
#it's able to count how many instances of a person occuring in that company

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [32]:
df.groupby('Company').max()
#Pythin stores things in alphabetical order
#the max is the latest alphabet

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

#### The Person and Sales do not always have to correspond to each other in the dataframe. From the aggregate function we've used, it just shows min or max value in each rows with respect to the Company column.

In [34]:
df #shouldn't be using min or max with a String column

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [40]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [41]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [44]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merging, Joining and Concatenating

In [45]:
#please see reference on the notebook for reviewing

# Operations

In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
print(len(df['col2'].unique()))
df['col2'].unique()

3

array([444, 555, 666], dtype=int64)

In [13]:
df['col2'].nunique()

3

In [16]:
df['col2'].value_counts() #how many time each unique value occurred in the column

444    2
555    1
666    1
Name: col2, dtype: int64

In [19]:
#Selecting data
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [20]:
#Applied function
#one of the most powerful methods
def times2(x):
    return x*2

In [21]:
df['col1'].sum()

10

In [22]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
df['col3'].apply(len) #applied build-in function

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [27]:
#applied with lambda expression
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [28]:
#removing column
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [31]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
#sorting & ordering
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [34]:
df.sort_values('col2') #the index stays attached to  the row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [35]:
#finds Nan
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [36]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [40]:
#create a multi-index out of this dataframe
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [44]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

* CSV
* Excel
* HTML
* SQL

In [6]:
import pandas as pd
import numpy as np

pwd # the CSV file or Excel file should be in this location

### CSV

In [7]:
#open and read CSV file
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
pd.read_ #then press tab to see the menu of the variety of formats pandas can read from

In [8]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
#write any format
df.to_csv('My_output') #index=false means we dont want to save this index as a column

In [10]:
pd.read_csv('My_output')
#2 ways to get rid of Unnamed: 0
#1. index=False , 2. index_col=0

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_csv('My_output',index=False)

In [15]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Excel

In [9]:
#Excel
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)
#this file must be in the same location as this notebook

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')
#have saved that to an excel file

AttributeError: 'list' object has no attribute 'to_excel'

In [13]:
pd.read_excel('Excel_Sample2.xlsx',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### HTML

In [15]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [16]:
type(data)

list

In [20]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

### SQL

In [18]:
from sqlalchemy import create_engine

In [19]:
engine = create_engine('sqlite:///:memory:')

In [20]:
df.to_sql('my_table',engine)

In [25]:
sqldf = pd.read_sql('my_table',con=engine)

In [26]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

# CLEAR!!!